class Stack():
    def __init__(self):
        pass

    def isEmpty(self): #проверка стека на пустоту. Метод возвращает True или False.
        pass

    def push(self): #Стек - абстрактный тип данных, представляющий собой список элементов, организованных по принципу LIFO (англ. last in — first out, «последним пришёл — первым вышел»).
        pass

    def pop(self): #удаляет верхний элемент стека. Стек изменяется. Метод возвращает верхний элемент стека
        pass

    def peek(self): #возвращает верхний элемент стека, но не удаляет его. Стек не меняется.
        pass

    def size(self): #возвращает количество элементов в стеке.
        pass